In [6]:
import pandas as pd
text = pd.read_csv('https://nlp100.github.io/data/popular-names.txt', sep='\t', header=None)
text

              0  1      2     3
0          Mary  F   7065  1880
1          Anna  F   2604  1880
2          Emma  F   2003  1880
3     Elizabeth  F   1939  1880
4        Minnie  F   1746  1880
...         ... ..    ...   ...
2775   Benjamin  M  13381  2018
2776     Elijah  M  12886  2018
2777      Lucas  M  12585  2018
2778      Mason  M  12435  2018
2779      Logan  M  12352  2018

[2780 rows x 4 columns]

## 10

In [7]:
text.shape[0]

2780

## 11

In [19]:
if not os.path.isdir('./output'):
    os.makedir('./output')
text.to_csv('./output/text.txt', sep=' ', index=False, header=None)

## 12

In [20]:
text.iloc[:, [0]].to_csv('./output/col1.txt', sep='\t', index=False, header=None)
text.iloc[:, [1]].to_csv('./output/col2.txt', sep='\t', index=False, header=None)

## 13

In [24]:
col1 = pd.read_csv('./output/col1.txt', sep='\t', header=None)
col2 = pd.read_csv('./output/col2.txt', sep='\t', header=None)
pd.concat([col1, col2], axis=1).to_csv('./output/col1+2.txt', sep='\t', index=False, header=None)

## 14

In [29]:
def head(df, n):
    return df.head(n)

head(text, 5)

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

## 15

In [30]:
def tail(df, n):
    return df.tail(n)

tail(text, 4)

           0  1      2     3
2776  Elijah  M  12886  2018
2777   Lucas  M  12585  2018
2778   Mason  M  12435  2018
2779   Logan  M  12352  2018

## 16

In [40]:
def split(df, n):
    height = int(np.ceil(df.shape[0] / n))
    return [df.iloc[k*height:(k+1)*height] for k in range(n)]

split(text, 3)

[             0  1      2     3
 0         Mary  F   7065  1880
 1         Anna  F   2604  1880
 2         Emma  F   2003  1880
 3    Elizabeth  F   1939  1880
 4       Minnie  F   1746  1880
 ..         ... ..    ...   ...
 922      Betty  F  32964  1926
 923      Helen  F  26884  1926
 924   Margaret  F  23070  1926
 925       Ruth  F  20223  1926
 926      Doris  F  16298  1926

 [927 rows x 4 columns],
                 0  1      2     3
 927      Virginia  F  16162  1926
 928       Mildred  F  13551  1926
 929       Frances  F  13355  1926
 930        Robert  M  61130  1926
 931          John  M  56110  1926
 ...           ... ..    ...   ...
 1849       Nicole  F  15752  1972
 1850      Michael  M  71405  1972
 1851  Christopher  M  52189  1972
 1852        James  M  47083  1972
 1853        David  M  46366  1972

 [927 rows x 4 columns],
              0  1      2     3
 1854      John  M  43181  1972
 1855    Robert  M  43037  1972
 1856     Jason  M  37446  1972
 1857     Brian  M  36322  1972
 1858   William  M  30529  1972
 ...        ... ..    ...   ...
 2775  Benjamin  M  13381  2018
 2776    Elijah  M  12886  2018
 2777     Lucas  M  12585  2018
 2778     Mason  M  12435  2018
 2779     Logan  M  12352  2018

 [926 rows x 4 columns]]

## 17

In [43]:
len(text.iloc[:, 0].unique())

136

## 18

In [47]:
text.sort_values(2, ascending=False)

            0  1      2     3
1340    Linda  F  99689  1947
1360    Linda  F  96211  1948
1350    James  M  94757  1947
1550  Michael  M  92704  1957
1351   Robert  M  91640  1947
...       ... ..    ...   ...
27      Annie  F   1326  1881
28     Bertha  F   1324  1881
8      Bertha  F   1320  1880
29      Alice  F   1308  1881
9       Sarah  F   1288  1880

[2780 rows x 4 columns]

## 19

In [54]:
text.iloc[:, 0].value_counts()

James      118
William    111
John       108
Robert     108
Mary        92
          ...
Scott        1
Lori         1
Laura        1
Tracy        1
Rachel       1
Name: 0, Length: 136, dtype: int64